app/Http/Livewire/DashboardGA/DashboardController.php

select * from `visitors` order by `id` asc limit 10 offset 0
select count(*) as aggregate from `visitors`
---
    public function render()
    {
        $this->visitors = Visitor::orderBy($this->sortBy, $this->orderBy ? 'asc' : 'desc')
            ->paginate($this->perPage);