app/Http/Livewire/EmployeeAccount.php

    public function render()
    {
        $employees = KaryawanGA::latest()->paginate($this->paginator);
        if ($this->search) {
            $employees =  KaryawanGA::where('NIK', 'LIKE', '%' . $this->search . '%')
                ->orWhere('name', 'LIKE', '%' . $this->search . '%')
                ->orWhere('email', 'LIKE', '%' . $this->search . '%')
                ->latest()->paginate($this->paginator);
        }
        return view('livewire.employee-account', [
            'employees' => $employees,
            'roles' => Role::whereNotIn('id', [6, 5])->get(),
        ])->extends('layout.apps');
---
select * from `karyawan_ga` order by `created_at` desc limit 10 offset 0
select count(*) as aggregate from `karyawan_ga`
select * from `roles` where `id` not in (6, 5)