app/Http/Livewire/MenuVendor.php

    public function render()
    {
        return view('livewire.menu-vendor', [
            'vendor_menus' => PaketMenu::all(),
        ]);
---
select * from `paket_menus`