app/Http/Livewire/VendorAccount.php

select * from `vendors`
---
    public function render()
    {
        return view('livewire.vendor-account', [
            'vendors' => Vendor::all(),
        ])->extends('layout.apps');