app/Http/Livewire/VisitorCheckingController.php

                    function ($query) {
                        $query->where('name', 'LIKE', "%" . $this->search . "%");
                    }
                )->paginate($this->paginator);
        } else {
            $visitors =  RegistrationVisitor::with(['visitor', 'karyawan_ga'])->paginate($this->paginator);
---
select * from `registration_visitors` limit 15 offset 0
select * from `visitors` where `visitors`.`id` in (7, 10, 12, 13, 19)
select count(*) as aggregate from `registration_visitors`