app/Http/Livewire/VisitorApprovalController.php

    public function render()
    {
        // $visitors = null;
        return view('livewire.visitor-approval-controller', [
            'visitors' => RegistrationVisitor::paginate($this->perPage),
        ])->extends('layout.apps');
---
select * from `registration_visitors`