app/Http/Controllers/CSReportController.php

    public function create(Request $req)
    {
        $validator = Validator::make($req->all(), [
            'nik_cs' => ['required'],
            'picture' => ['required', 'image', 'mimes:png,jpg,jpeg'],
            'location' => ['required', 'string'],
        ], [
            '*' => 'masukkan kolom value untuk kolom ini',
            'picture.image' => 'Hanya berupa image',
            'picture.mimes' => 'Masukkan berupa image',
            'location.string' => 'Masuk nilai berupa alpabet'
        ]);
        if ($validator->fails()) { //
            return response()->json([
                'status' => false,
                'error' => $validator->errors()->toArray()
            ]);
        } else {
            $data = [
                'nik_cs' => $req->nik_cs,
                'picture' => '',
                'location' => $req->location,
            ];
            if ($req->hasFile('picture')) {
                $name_file = $req->file('picture')->getClientOriginalName();
                $req->file('picture')
                    ->move('pictures/', Str::random(10) . $name_file);
                $data['picture'] = $name_file;
            }
            $cs_report =  CS_Report::create($data);
---
insert into `c_s__reports` (`nik_cs`, `location`, `picture`, `updated_at`, `created_at`) values ('12129237828323', 'ersalomo', '{}', '2022-11-02 12:32:57', '2022-11-02 12:32:57')