app/Http/Controllers/FoodOrderControler.php

select * from `paket_menus`
---
    public function index(Request $req)
    {
        return view('layout/navigation-sidebar/food-management.food-order', [
            'paketMenus' => PaketMenu::all(),
        ]);

select * from `order_menus` where `NIK_Karyawan` = 16673910252968 limit 1
insert into `order_menus` (`NIK_Karyawan`, `id_paket_menu`, `updated_at`, `created_at`) values (16673910252968, '9', '2022-12-23 10:24:28', '2022-12-23 10:24:28')
---
    public function orderFood($id)
    {
        $nik_karyawan = auth('karyawan_gaa')->id();

        if (OrderMenu::where('NIK_Karyawan', $nik_karyawan)->first()) {
            return response()->json([
                'message' => 'Kamu tidak bisa memesan lagi'
            ], 422);
        }
        $orderMenu = new OrderMenu();
        $orderMenu->NIK_Karyawan = $nik_karyawan;
        $orderMenu->id_paket_menu = $id;
        $save = $orderMenu->save();