app/Http/Controllers/VendorController.php

    public function getMenus(Request $req)
    {
        if ($req->has('q')) {
            $menus = Menu::orderBy('name', 'asc')->where('name', 'like', "%$req->q%")
                ->limit(5)->get();
        } else {
            $menus = Menu::orderBy('name', 'asc')
                ->limit(5)->get();
---
select * from `menus` where `name` like '%%' order by `name` asc limit 5
select * from `menus` order by `name` asc limit 5