app/Models/Visitor.php

    public function isRegistered(): bool // check dari belongsTo aja
    {
        $id_visitors = Link::get(['id_visitor'])->toArray();
---
select `id_visitor` from `links`